examples/Qudi.Example.SimpleCase.Worker/assets/visualization_output.mermaid
graph LR
    Qudi_Example_Worker_NotifyToLogger["Qudi.Example.Worker.NotifyToLogger"]
    Qudi_Example_Core_INotificationService["Qudi.Example.Core.INotificationService"]
    Microsoft_Extensions_Logging_ILogger_Qudi_Example_Worker_NotifyToLogger_["Microsoft.Extensions.Logging.ILogger<Qudi.Example.Worker.NotifyToLogger>"]
    Qudi_Example_Core_NotifyPokemonInfoService["Qudi.Example.Core.NotifyPokemonInfoService"]
    Qudi_Example_Core_IPokemon["Qudi.Example.Core.IPokemon"]
    Qudi_Example_Core_Altaria["Qudi.Example.Core.Altaria"]
    Qudi_Example_Core_Garchomp["Qudi.Example.Core.Garchomp"]
    Qudi_Example_Worker_NotifyDecorator["Qudi.Example.Worker.NotifyDecorator"]
    Qudi_Example_Core_INotificationService --> Qudi_Example_Worker_NotifyToLogger
    Qudi_Example_Worker_NotifyToLogger --> Microsoft_Extensions_Logging_ILogger_Qudi_Example_Worker_NotifyToLogger_
    Qudi_Example_Core_NotifyPokemonInfoService --> Qudi_Example_Core_NotifyPokemonInfoService
    Qudi_Example_Core_NotifyPokemonInfoService -.->|"*"| Qudi_Example_Core_IPokemon
    Qudi_Example_Core_NotifyPokemonInfoService --> Qudi_Example_Core_INotificationService
    Qudi_Example_Core_IPokemon --> Qudi_Example_Core_Altaria
    Qudi_Example_Core_IPokemon --> Qudi_Example_Core_Garchomp
    Qudi_Example_Core_INotificationService ==> Qudi_Example_Worker_NotifyDecorator
    Qudi_Example_Worker_NotifyDecorator -.-> Qudi_Example_Core_INotificationService
    classDef decorator fill:#add8e6,stroke:#4682b4,stroke-width:2px;
    class Qudi_Example_Worker_NotifyDecorator decorator;
